Revit 2020 API
Speckle Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Speckle
Visual Basic
Public NotInheritable Class Speckle
Visual C++
public ref class Speckle abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Speckle
See Also
Speckle Members
Autodesk.Revit.DB.Visual Namespace